___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df.shape

(6, 3)

In [4]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

In [5]:
df.shape

(6, 3)

** Now you can use the .groupby() method to group rows together based on a column name. For instance let's group based on Company. This will create a DataFrameGroupBy object:**

In [6]:
df.groupby('Company')

You can save this object as a new variable:

In [9]:
by_comp = df.groupby("Company")

In [8]:
by_comp.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

And then call aggregate methods off the object:

In [10]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [11]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [11]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [12]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [12]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [14]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [15]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [15]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
by_comp.describe() #stastistical analsysis

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [16]:
by_comp.describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

In [17]:
by_comp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [18]:
df['profit'] = [100,200,300,400,500,600]

In [21]:
df.head()

  Company   Person  Sales  profit
0    GOOG      Sam    200     100
1    GOOG  Charlie    120     200
2    MSFT      Amy    340     300
3    MSFT  Vanessa    124     400
4      FB     Carl    243     500

In [23]:
new =df.groupby('Company').sum()

In [24]:
new

         Sales  profit
Company
FB         593    1100
GOOG       320     300
MSFT       464     700

In [15]:
#class work 
#create a new column named supervisor, assign values, them split 
#add the new column to the data data frame
#groupby and perfom some aggregrate function

         Sales
Company
FB         593
GOOG       320
MSFT       464

# Great Job!